<a href="https://colab.research.google.com/github/milhamm/knn-introduction-to-ai/blob/main/AI_Programming_Assignment_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Group 2 AI Assignment - kNN**

In [66]:
import numpy as np
import pandas as pd
from math import sqrt

## **Data Reading**

In [67]:
data = pd.read_excel("https://github.com/milhamm/knn-introduction-to-ai/blob/main/mobil.xls?raw=true")
data.head()

       Nama Mobil  Ukuran  Kenyamanan  Irit  Kecepatan  Harga (Ratus Juta)
0     Toyota Agya       4           4     9          6                1.00
1   Daihatsu Alya       4           3     9          6                1.10
2   Toyota Avanza       6           5     6          6                2.00
3  Daihatsu Xenia       6           4     6          6                1.75
4         Xpander       7           7     6          7                2.25

## **Data Preprocessing**

In [68]:
# Check for null values
data.isna().sum()

# Drop the name column
df = data.drop(["Nama Mobil"], axis = 1)

## **Distance Methods**

In [69]:
def manhattan(x, y):
  return sum([abs(x[i] - y[i]) for i in range(len(x))])

def euclidean(x, y):
  return sqrt(sum([(x[i] - y[i]) ** 2 for i in range(len(x))]))

def minkowski(x, y, r):
  return sum([abs(x[i] - y[i]) ** r for i in range(len(x))]) ** (1./ r)

def supremum(x, y):
  return max([abs(x[i] - y[i]) for i in range(len(x))])

## **k-Nearest Neighbour**

In [70]:
training_data = [4, 8, 7, 9, 4.3]

def knn(k):
  manhattan_distance = []
  euclidean_distance = []
  minkowski_distance = []
  supremum_distance = []
  
  df_list = df.values

  for x in df_list:
    manhattan_distance.append(manhattan(x, training_data))
    euclidean_distance.append(euclidean(x, training_data))
    minkowski_distance.append(minkowski(x, training_data, 3))
    supremum_distance.append(supremum(x, training_data))
  data["manhattan"], data["euclidean"], data["minkowski"], data["supremum"]  = manhattan_distance, euclidean_distance, minkowski_distance, supremum_distance

  manhattan_sorted = data.sort_values(by=['manhattan'])[:k]
  euclidean_sorted = data.sort_values(by=['euclidean'])[:k]
  minkowski_sorted = data.sort_values(by=['minkowski'])[:k]
  supremum_sorted = data.sort_values(by=['supremum'])[:k]

  manhattan_sorted["Nama Mobil"].to_excel('rekomendasi.xls', index=False, header=False)

  return manhattan_sorted, euclidean_sorted, minkowski_sorted, supremum_sorted

man, euc, min, sup = knn(3)
print(man, euc, min, sup)

              Nama Mobil  Ukuran  Kenyamanan  ...  euclidean  minkowski  supremum
10            Honda City       5           8  ...   2.135416   1.826761       1.6
14  Toyota Corolla Altis       5           9  ...   2.211334   1.904973       1.7
9            Toyota Vios       5           7  ...   3.200000   2.562783       2.0

[3 rows x 10 columns]               Nama Mobil  Ukuran  Kenyamanan  ...  euclidean  minkowski  supremum
10            Honda City       5           8  ...   2.135416   1.826761       1.6
14  Toyota Corolla Altis       5           9  ...   2.211334   1.904973       1.7
9            Toyota Vios       5           7  ...   3.200000   2.562783       2.0

[3 rows x 10 columns]               Nama Mobil  Ukuran  Kenyamanan  ...  euclidean  minkowski  supremum
10            Honda City       5           8  ...   2.135416   1.826761       1.6
14  Toyota Corolla Altis       5           9  ...   2.211334   1.904973       1.7
9            Toyota Vios       5           7  ...   3.200000   2.562783       2.0

[3 rows x 10 columns]               Nama Mobil  Ukuran  Kenyamanan  ...  euclidean  minkowski  supremum
10            Honda City       5           8  ...   2.135416   1.826761       1.6
14  Toyota Corolla Altis       5           9  ...   2.211334   1.904973       1.7
9            Toyota Vios       5           7  ...   3.200000   2.562783       2.0

[3 rows x 10 columns]